[
  {
    "date": "Fri, 20 Feb 2026 00:00:00 GMT",
    "product": "SitecoreAI",
    "title": "Introducing the external asset picker for content",
    "link": "https://developers.sitecore.com//changelog/content-hub/20022026/introducing-the-external-asset-picker-for-content",
    "summary": "1. Sitecore has introduced an external asset picker for the rich text editor, allowing users to insert media from external digital asset management systems (DAM) like Bynder.  ",
    "impact": "2. This enhancement improves content flexibility and accessibility by enabling users to reference and manage assets from various external sources, streamlining content creation processes."
  },
  {
    "date": "Fri, 20 Feb 2026 00:00:00 GMT",
    "product": "SitecoreAI",
    "title": "Analytics is now generally available",
    "link": "https://developers.sitecore.com//changelog/content-hub/20022026/analytics-is-now-generally-available",
    "summary": "1. The Analytics feature has transitioned to general availability, offering insights through the System insights and Content effectiveness pages to track entity performance and link engagement.  ",
    "impact": "2. This update allows users to gain valuable metrics on content performance and entity management, enhancing data-driven decisions and optimizing user engagement strategies."
  },
  {
    "date": "Fri, 20 Feb 2026 00:00:00 GMT",
    "product": "SitecoreAI",
    "title": "Resolved issues in Content Hub for 20 Feb 2026",
    "link": "https://developers.sitecore.com//changelog/content-hub/20022026/resolved-issues-in-content-hub-for-20-feb-2026",
    "summary": "1. Sitecore's Content Hub update resolves several issues, including enhancements to validation logic, mass edit functionality, and interface display settings.  ",
    "impact": "2. These fixes improve user experience by ensuring accurate data handling, a consistent layout, and proper rendering, ultimately leading to more efficient content management."
  },
  {
    "date": "Thu, 19 Feb 2026 00:00:00 GMT",
    "product": "SitecoreAI",
    "title": "Saving AI generated variants is now easier",
    "link": "https://developers.sitecore.com//changelog/sitecoreai/19022026/saving-ai-generated-variants-is-now-easier",
    "summary": "1. Sitecore has streamlined the process of saving AI-generated variants by allowing users to install them directly into their repository using the Sitecore CLI.  ",
    "impact": "2. This enhancement simplifies and speeds up the workflow, making it more efficient for users to reuse AI-generated content in SitecoreAI."
  },
  {
    "date": "Wed, 18 Feb 2026 00:00:00 GMT",
    "product": "SitecoreAI",
    "title": "Enhanced visibility and control for page items and publishing",
    "link": "https://developers.sitecore.com//changelog/sitecoreai/18022026/enhanced-visibility-and-control-for-page-items-and-publishing",
    "summary": "1. Sitecore has enhanced the content tree by allowing users to view and manage referenced items connected to pages, along with offering flexible publishing options.  ",
    "impact": "2. This update improves content oversight and auditing processes while providing greater control over the publishing of related items, streamlining workflow management for users."
  },
  {
    "date": "Mon, 16 Feb 2026 00:00:00 GMT",
    "product": "SitecoreAI",
    "title": "Page builder usability improvements and solved issues",
    "link": "https://developers.sitecore.com//changelog/sitecoreai/16022026/page-builder-usability-improvements-and-solved-issues",
    "summary": "1. The Page builder update enhances usability by displaying available page versions per language and resolves several issues related to permissions and item duplication.  ",
    "impact": "2. These improvements streamline content management for users, ensuring accurate item representation and effective collaboration by maintaining consistent permissions."
  },
  {
    "date": "Wed, 11 Feb 2026 00:00:00 GMT",
    "product": "SitecoreAI",
    "title": "Resolved issue in Content Hub for February 11, 2026",
    "link": "https://developers.sitecore.com//changelog/content-hub/11022026/resolved-issue-in-content-hub-for-february-11%2c-2026",
    "summary": "1. Sitecore improved stability and performance of Content Hub search indexing in the February 11, 2026 update.  ",
    "impact": "2. This enhancement ensures faster and more reliable content retrieval, benefiting overall user experience and efficiency."
  },
  {
    "date": "Wed, 11 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "Introducing search experiences in SitecoreAI",
    "link": "https://developers.sitecore.com//changelog/sitecoreai/11022026/introducing-search-experiences-in-sitecoreai",
    "summary": "1. SitecoreAI introduces a new configurable search component that allows users to create dynamic search experiences on their websites.  ",
    "impact": "2. This feature enhances content discoverability and presentation, enabling better user engagement and more tailored search results."
  },
  {
    "date": "Wed, 11 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "New features for Conversion optimization",
    "link": "https://developers.sitecore.com//changelog/sitecoreai/11022026/new-features-for-conversion-optimization",
    "summary": "1. Sitecore's latest update introduces enhancements for conversion optimization, including tailored search experiences, audience targeting through affinities, and new analytics dashboards.  ",
    "impact": "2. These features empower organizations to deliver personalized content, improve user engagement, and gain actionable insights into visitor behavior, ultimately boosting business outcomes."
  },
  {
    "date": "Wed, 11 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "Understand your audience with identity resolution and affinities",
    "link": "https://developers.sitecore.com//changelog/sitecoreai/11022026/understand-your-audience-with-identity-resolution-and-affinities",
    "summary": "1. SitecoreAI introduces identity resolution and affinities, enabling better audience understanding and more personalized content delivery.  ",
    "impact": "2. This matters because it allows organizations to engage visitors more effectively by leveraging real-time insights into their preferences and behaviors."
  },
  {
    "date": "Wed, 11 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "New Top affinity condition for Personalize audiences",
    "link": "https://developers.sitecore.com//changelog/sitecoreai/11022026/new-top-affinity-condition-for-personalize-audiences",
    "summary": "1. Sitecore introduces a new Top affinity condition in the AI Page builder for more precise audience targeting based on visitors' strongest interests.  ",
    "impact": "2. This enhancement allows campaigns to activate content when visitor intent is highest, improving engagement through focused and relevant targeting."
  },
  {
    "date": "Wed, 11 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "Marketplace - Support for the Search Configuration REST API and other API changes in the SDK",
    "link": "https://developers.sitecore.com//changelog/marketplace/11022026/marketplace---support-for-the-search-configuration-rest-api-and-other-api-changes-in-the-sdk",
    "summary": "1. Sitecore has added support for the Search Configuration REST API in Marketplace SDK version 0.4, enabling apps to manage search source configurations effectively.  ",
    "impact": "2. This update enhances the functionality of SitecoreAI APIs, improving how content is indexed and searched, which is crucial for optimizing user search experiences."
  },
  {
    "date": "Tue, 10 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "SitecoreAI base image 1.6.1376 release",
    "link": "https://developers.sitecore.com//changelog/sitecoreai/10022026/sitecoreai-base-image-1.6.1376-release",
    "summary": "1. SitecoreAI base image 1.6.1376 introduces Allowed Renderings at the Styles parent item level, simplifying style management and ensuring consistency across components while also addressing various bugs.  ",
    "impact": "2. This update enhances user experience by reducing configuration effort and minimizing errors, thereby improving the overall reliability and performance of the Sitecore platform."
  },
  {
    "date": "Mon, 09 Feb 2026 00:00:00 GMT",
    "product": "SitecoreAI",
    "title": "Resolved issue in Content Hub for February 9, 2026",
    "link": "https://developers.sitecore.com//changelog/content-hub/09022026/resolved-issue-in-content-hub-for-february-9%2c-2026",
    "summary": "1. Sitecore has improved the stability and performance of search indexing in Content Hub as of February 9, 2026.  ",
    "impact": "2. This update enhances user experience by ensuring faster and more reliable search functionality within the Content Hub."
  },
  {
    "date": "Fri, 06 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "Upcoming change to CI Hub asset upload configuration",
    "link": "https://developers.sitecore.com//changelog/content-hub/06022026/upcoming-change-to-ci-hub-asset-upload-configuration",
    "summary": "1. Sitecore is transitioning asset upload configuration from AssetUploadConfiguration to CiHubAssetUploadConfiguration and will copy current settings to the new entity.  ",
    "impact": "2. This change is important to prevent disruption in asset uploads, but users must update both configurations during the transition period to ensure proper functionality."
  },
  {
    "date": "Fri, 06 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "Introducing the Sitecore Content Hub DAM Connector for Contentful",
    "link": "https://developers.sitecore.com//changelog/content-hub/06022026/introducing-the-sitecore-content-hub-dam-connector-for-contentful",
    "summary": "1. Sitecore has launched the Content Hub DAM Connector for Contentful, allowing seamless access to approved assets from Content Hub within Contentful.  ",
    "impact": "2. This integration enhances content management by centralizing assets, improving efficiency for authors and editors in their workflow."
  },
  {
    "date": "Fri, 06 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "In-app notifications are now available for more events",
    "link": "https://developers.sitecore.com//changelog/content-hub/06022026/in-app-notifications-are-now-available-for-more-events",
    "summary": "1. In-app notifications are now expanded to include events such as completed/failed background jobs and task-related updates for greater flexibility.  ",
    "impact": "2. This enhancement allows users to customize notification preferences, enabling real-time awareness while facilitating later reviews of important events."
  },
  {
    "date": "Fri, 06 Feb 2026 00:00:00 GMT",
    "product": "Sitecore",
    "title": "AI-assisted smart brief generation is now generally available",
    "link": "https://developers.sitecore.com//changelog/content-hub/06022026/ai-assisted-smart-brief-generation-is-now-generally-available",
    "summary": "1. The AI-assisted smart brief feature has transitioned from beta to general availability, enabling marketers to efficiently create briefs with AI support.  ",
    "impact": "2. This update enhances productivity by allowing for quicker brief creation and improved content relevance, streamlining the marketing process."
  }
]